<img src="http://oci02.img.iteso.mx/identidad_de_instancia_2018/ITESO/Logos%20ITESO/Logo-ITESO-Principal.jpg">

<center> <font color= #004A94> <font size = 6> Msc Ciencia de datos </font> <br> <br> <font color= #047CFB> <font size = 5>I.F. Juan Francisco Muñoz Elguezabal</font> <br> <br>

<center><font color= #004A94> <font size = 6> INVESTIGACIÓN, DESARROLLO E INNOVACIÓN - 1 </font> <br>

<center><font color= #42c29b> <font size = 6> Tarea 1: </font> <br> <br> <font color= #047CFB> <font size = 5>Repositorio: <a href='https://github.com/IFFranciscoME/FinTechLab/'>Link</a></font>

---

### Indicaciones

Utilizando el archivo adjunto realice código en Python que realice las siguientes acciones.

Primero lea la hoja vt en un Dataframe vt y sobre este:

- Suponga que ha habido un olvido y no se tomó en cuenta un Ingreso mensual de $1000 en todos los meses.
- Modifique el DataFrame para aumentar en $1000 los ingresos de cada mes.
- Agregue una columna Utilidad (Ingreso - Gasto).
- Encuentre el promedio de Gasto en los meses en los que la Utilidad fue negativa.
- Encuentre los ingresos totales del año.
- Encuentre la lista de los meses en los que la Utilidad fue positiva.
 
Ahora lea la hoja 8c, que representa las distancias en kilómetros entre una serie de ciudades, en un Dataframe cd y sobre este:

- Convierta todos los valores a millas (km/1.609)
- Genere una serie llamada gdl con las distancias a partir de Guadalajara a todas las ciudades.
- Encuentre la lista de las ciudades que están a más de 1000 millas de Guadalajara.

In [21]:
import pandas as pd
import numpy as np

### Hoja VT

In [17]:
datos = pd.read_excel('datosCT.xlsx', sheet_name='vt')

In [18]:
datos.head()

         Ingreso  Gasto
Enero       1340   1880
Febrero     2590   3130
Marzo       3570   2140
Abril       4450   3370
Mayo        1330   2990

#### Suponga que ha habido un olvido y no se tomó en cuenta un Ingreso mensual de 1,000 en todos los meses, modifique el DataFrame para aumentar en 1,000 los ingresos de cada mes.

In [19]:
datos['Ingreso'] = datos['Ingreso'] + 1000
datos.head()

         Ingreso  Gasto
Enero       2340   1880
Febrero     3590   3130
Marzo       4570   2140
Abril       5450   3370
Mayo        2330   2990

#### Agregue una columna Utilidad (Ingreso - Gasto).

In [20]:
datos['Utilidad'] = datos['Ingreso'] - datos['Gasto']
datos.head()

         Ingreso  Gasto  Utilidad
Enero       2340   1880       460
Febrero     3590   3130       460
Marzo       4570   2140      2430
Abril       5450   3370      2080
Mayo        2330   2990      -660

#### Encuentre el promedio de Gasto en los meses en los que la Utilidad fue negativa.

In [35]:
datos.iloc[np.where(datos['Utilidad'] < 0)]['Gasto'].mean()

3065.0

#### Encuentre los ingresos totales del año.

In [38]:
datos['Ingreso'].sum()

40020

#### Encuentre la lista de los meses en los que la Utilidad fue positiva.

In [41]:
list(datos.iloc[np.where(datos['Utilidad'] < 0)].index)

['Mayo', 'Diciembre']

### Hoja 8c

In [67]:
datos = pd.read_excel('datosCT.xlsx', sheet_name='8c')
datos.head()

         Tijuana  Mérida   GDL  México  León  Monterrey  Tapachula  Chihuahua
Tijuana        0    4180  2306    2848  2529       2409       4005       1583
Mérida      4180       0  1874    1332  1719       2046       1062       2819
GDL         2306    1874     0     542   223        789       1699       1202
México      2848    1332   542       0   389        933       1157       1487
León        2529    1719   223     389     0        711       1544       1140

#### Convierta todos los valores a millas (km/1.609)

In [78]:
estados = list(datos.columns)
datos = round(datos.iloc[:,:].div(1.609, axis=0), 2)
datos

,Tijuana,Mérida,GDL,México,León,Monterrey,Tapachula,Chihuahua
Tijuana,0.00,1614.60,890.73,1100.09,976.87,930.52,1547.00,611.46
Mérida,1003.48,0.00,723.86,514.51,663.99,790.30,410.22,1088.89
GDL,553.59,723.86,0.00,209.36,86.14,304.76,656.27,464.29
México,683.71,514.51,209.36,0.00,150.26,360.39,446.91,574.38
León,607.13,663.99,86.14,150.26,0.00,274.64,596.40,440.34
Monterrey,578.32,790.30,304.76,360.39,274.64,0.00,696.44,319.06
Tapachula,961.47,410.22,656.27,446.91,596.40,696.44,0.00,1021.29
Chihuahua,380.03,1088.89,464.29,574.38,440.34,319.06,1021.29,0.00

#### Genere una serie llamada gdl con las distancias a partir de Guadalajara a todas las ciudades.

In [87]:
gdl = list(datos.loc['GDL', :])
gdl

[553.59, 723.86, 0.0, 209.36, 86.14, 304.76, 656.27, 464.29]

#### Encuentre la lista de las ciudades que están a más de 1000 millas de Guadalajara.

In [93]:
list(np.where(datos.loc['GDL', :] > 1000)[0])

[]